import React from 'react';

const Blogs = () => {
  return (
    <div className='container mt-4'>
      <div className="row g-3">
        <div className="col-12">
          <h4 className='fw-bold text-success p-2'> প্রমাণীকরণ(Authentication) এবং অনুমোদনের(Authorization) মধ্যে পার্থক্য ? </h4>
          <h6 className="text-muted p-2"> প্রমাণীকরণ হল কেউ কে তা যাচাই করার প্রক্রিয়া । অনুমোদন হল ব্যবহারকারীর কোন নির্দিষ্ট অ্যাপ্লিকেশন, ফাইল এবং ডেটাতে অ্যাক্সেস রয়েছে তা যাচাই করার প্রক্রিয়া। প্রমাণীকরণ নির্ধারণ করে যে ব্যক্তিটি ব্যবহারকারী কিনা । অনুমোদন নির্ধারণ করে ব্যবহারকারীর  অনুমতি আছে কি না। প্রমাণীকরণ প্রক্রিয়ায়, ব্যবহারকারী বা ব্যক্তিদের যাচাই করা হয়। এই প্রক্রিয়া চলাকালীন, ব্যবহারকারী বা ব্যক্তিদের যাচাই করা হয়। প্রমাণীকরণ ব্যবহারকারীর দ্বারা দৃশ্যমান এবং আংশিকভাবে পরিবর্তনযোগ্য । অনুমোদন ব্যবহারকারীর কাছে দৃশ্যমান বা পরিবর্তনযোগ্য নয়।
          </h6>
        </div>
        <div className="col-12">
          <h4 className='fw-bold text-success p-2'>কেন আপনি ফায়ারবেস(Firebase) ব্যবহার করছেন? প্রমাণীকরণ(Authentication) বাস্তবায়নের জন্য আপনার কাছে অন্য কোন বিকল্প আছে? </h4>
          <h6 className="text-muted p-2">ফায়ারবেস স্টার্টআপ থেকে শুরু করে গ্লোবাল এন্টারপ্রাইজ পর্যন্ত সফল অ্যাপ তৈরি ও চালাতে সাহায্য করে। Firebase ডাটাবেসের সমস্ত ডেটা রিয়েল-টাইম পরিচালনা করে ৷ সুতরাং, ডাটাবেস থেকে ডেটা আদান-প্রদান সহজ এবং দ্রুত । তাই লাইভ স্ট্রিমিং, চ্যাট মেসেজিং ইত্যাদির মতো মোবাইল অ্যাপস ডেভেলপ করতে  Firebase ব্যবহার করতে পারি ।
            সাধারণত প্রমাণীকরণ বাস্তবায়নের অন্যান্য উপায়গুলি কার্ড, রেটিনা স্ক্যান, ভয়েস রিকগনিশন এবং আঙ্গুলের ছাপের মাধ্যমে বিকল্প হতে পারে।
          </h6>
        </div>
        <div className="col-12">
          <h4 className='fw-bold text-success p-2'> ফায়ারবেস(Firebase) প্রমাণীকরণ(Authentication) ব্যতীত অন্য কোন পরিষেবা প্রদান করে ? </h4>
          <h6 className="text-muted p-2">Firebase প্রমাণীকরণ ব্যাকএন্ড পরিষেবা, সহজে ব্যবহারযোগ্য SDK এবং অ্যাপে ব্যবহারকারীদের প্রমাণীকরণের জন্য তৈরি UI লাইব্রেরি প্রদান করে । Firebase মাধ্যমে নির্বিঘ্নে রিয়েলটাইম ডেটাবেসে একটি চ্যাট রুম সেট আপ করা যায় । ফায়ারবেসের ক্লাউড স্টোরেজ ব্যবহার করে দ্রুত, নিরাপদে ক্লাউডে ব্যবহারকারীদের ছবি হোস্ট করা যায়। তারপর শেয়ারিং সক্ষম করতে রিয়েলটাইম ডেটাবেসে তাদের ফাইল পাথ রেকর্ড করে । Firebase  নিজস্ব সার্ভার সেট আপ না করেই নিরাপদে  পেমেন্ট API গুলিকে কল করার অনুমতি দিয়ে অভিজ্ঞতাকে আরও সুগম করে।</h6>
        </div>
      </div>
    </div>
  );
};

export default Blogs;